{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"20190718随想","text":"有很多事情值得花时间去做，比天天沉溺于过去不能自拔强多了。","link":"/2019/07/18/20190718随想/"},{"title":"2019书单","text":"消磨时间类 [x]《嫌疑人X的献身》 看看盛名之下，是不是难负。 [ ] 《美丽新世界》 反乌托邦 [ ] 《剑桥简明金庸武侠史》 新垣平的作品，他还有个臭名昭著的名字宝树。《三体》出不了续集就是他给毁的，但这并不代表这本书不幽默诙谐。 [ ] 《巨人的陨落》（第二部）（第三部） 其实还有6本没看掉。 [ ] 《男人来自火星，女人来自金星》 老书了，当作心灵鸡汤吧。 [ ] 《番茄工作法图解》 看下如何才能和自己的workflow结合在一起 [ ] 《三体》（英文版） 刘宇昆翻译的，读完也是遥遥无期了。 [ ] 《疯癫与文明》 可推荐的。但我略翻阅了几页，呃呃，并不认为我有能力精读此书 [ ] 《红星闪耀中国》 斯诺写的，我党得天下民心所向。 [ ] 《天才在左，疯子在右》 老书了。大烂书，不看了。 [ ] 《菊与刀》 老书了。 [ ] 《乌合之众》 读心理学的同学说这本书全是扯淡，我倒要看看怎么扯淡 [ ] 《礼物的流动》 民族志实在是太有意思了，读懂它可以对当代农村现状管窥一豹。 [ ] 《小王子》 高中送我最好的朋友，但自己从来没读过。 [ ] 《亲密关系》 这本书真的可以反复读。 [ ] 《陶庵梦忆》 张岱的游记，实在是有趣，成书于国破家亡之后。我最喜欢的《湖心亭看雪》就出于此。 [ ] 《变形记》 表现主义的书，我大概是读不懂了。 [X] 《流浪地球制作手记》 [X] 《乡村教师》 [X] 《流浪地球》 专业书 [X] 《精通CSS：高级Web标准解决方案（第二版）》 [ ] 《重构第二版》 [ ] 《CSS世界》 [ ]","link":"/2019/04/24/2019书单/"},{"title":"from zero to hero","text":"未来要完成的事情，排名不分先后。 1.⭐⭐⭐⭐⭐爬遍五岳（北岳恒山，南岳衡山，西岳华山，东岳泰山， 中岳嵩山）+ 黄山华山还要去至少两次，一次夜爬华山至朝阳峰看日出，一次走智取华山路，华山两大险鹞子翻身与长空栈道，前者已经体验过了，后者由于去时暂停开放，还未体验。 2.⭐⭐⭐⭐⭐首先完成一次半马，最后完成一次全🐎。遥遥无期，毕竟配速为5。 3.⭐⭐去趟珠峰大本营。 4.⭐⭐⭐⭐⭐把《红楼梦》看了。此书已是多次翻阅却半途而废。 5.⭐⭐⭐学会游泳。指的是除了狗爬式以外的泳姿都会一点😢 6.⭐⭐⭐⭐⭐一年一度的金庸武侠之旅。 年度 | 地点 —- | —- 2019 | 西安、华山 7.⭐⭐⭐⭐⭐体脂15% 遥遥无期 8.⭐⭐⭐⭐⭐在Lebron James退役之前去趟LA看比赛。（当年高中毕业也说过在科比退役之前去趟LA看比赛，sigh～） 9.⭐⭐我什么时候能把塞尔达小姐姐救出来，DLC打掉，遥遥无期。","link":"/2019/06/21/from-zero-to-hero/"},{"title":"《剑桥简明金庸武侠史》阅读笔记","text":"词条 《书本与剑的档案：乾隆帝与中国秘密社会》《书剑恩仇录》 《绿色血液之剑：袁承志与明清政治》《碧血剑》 《射雕的英雄：一部传记》《射雕英雄传》 《神圣的雕之罗曼史》《神雕侠侣》 《飞翔狐狸：一位18世纪游侠的个案研究》《飞狐外传》 《狐狸，飞过雪山》《雪山飞狐》 《天之剑与龙之刀：元代武林世界与地下宗教》《倚天屠龙记》 《满大人鸭子刀的传说与历史》《鸳鸯刀》 《哭泣的白马，随风而去》《白马啸西风》 《秘密如同城市》《连城诀》 《天神与龙的战争史：北宋后期的武术世界》《天龙八部》 《江河与湖泊上微笑而骄傲的漫游者：明代中期武术门派与教派的战争》《笑傲江湖》 《越国女士的剑》《越女剑》 《三十三位武术家》《三十三剑客图》 《鹿鼎宫爵传》 《鹿鼎记》","link":"/2019/04/04/《剑桥简明金庸武侠史》阅读笔记/"},{"title":"一点点想法","text":"胡思乱想 2019-07-22如何才能优雅的写样式。 2019-07-23不想浪费时间在做兼容性上，真的浪费时间。","link":"/2019/07/22/一点点想法/"},{"title":"《潜伏》之历史名词","text":"E1 旧金山会议 鸡鹅巷时期 上海青浦特训班 陈布雷 剧中彦吉先生指的就是陈布雷 曾家岩50号 曾家岩50号，又名周公馆，是中共中央南方局和八路军重庆办事处市区办公室旧址。鄙人幼时应该去过，接受过爱国主义教育。 四一大会 军统每年4月1日召开的大会，旨在悼念所谓“殉难”、“殉职”、“殉法”的特务。 万里浪 康泽 剧中，曾提及康泽与蒋经国斗法，为复兴社创始人之一。 李世群 剧中人物，原型为李士群。汪伪特工总部76号二号人物。 丁默村 剧中人物，原型为丁默邨。汪伪特工总部76号一号人物。 梅机关 E2 抓CC，抓三青 CC指的是Central Club，二陈创建的政治派系。三青指的是三民主义青年团 E7 边保 陕甘宁边区政府保安处 社保 中共中央社会部 E8 觉悟社 政学 李士珍 警校派首脑，与戴笠素有不和。说来有趣，与鄙人是校友，之江大学毕业（后zju）。据传闻，戴笠出事与其有关。剧中，准备在八大会议中将戴踢出警察系统。","link":"/2018/10/12/《潜伏》之历史名词/"},{"title":"摸鱼大法","text":"古人云：水至清则无鱼。只有浑水才能摸鱼。古人又云：工欲善其事，必先利其器。因此，只有做好准备才能更好的划水。 免责声明：本人作为上一年度公司优秀员工，热爱工作，热衷于技术、想法的分享与交流。本文仅做交流心得用，若出现难以预料之后果，概不负责。","link":"/2019/07/23/摸鱼大法/"},{"title":"人类的三大本质","text":"大数定律即必然。当样本空间足够大时，足以证明人类三大本质的正确性。 人类的本质是复读机鸽子为什么那么大真香 老妈送了一串转运珠，去金店之前，还抱怨说金器太土气了，还不如买一个带钻的戒指。结果真香啊，买来戴上就不想摘了。","link":"/2019/06/23/人类的三大本质/"},{"title":"愚公解梦","text":"记录浅睡眠中光怪陆离的梦境注：时间的展示例如2019-06-18指的是0617晚上至0618清晨 2019-06-18全家去爬江郎山，快爬到山顶，突降雪❄️，未能登顶。 2019-06-21家中洗衣机入水阀门一直在漏水，而且漏得很严重。准备洗衣服，在洗衣机第一次储水后，将阀门关闭，但又想洗衣的过程中，会二次进水，于是将阀门又打开了，但漏水不断，遂将一脸盆放于底部接水。梦中，洗衣机及阀门位置被逆时针旋转了90度。 2019-06-27和她一起爬山，山在富阳临安以西，从武林门可以坐船前往，爬下来后下了大雨。时间跨越到抗日战争时期，我摇身一变变成了一名战士，和仅存的几十个弟兄守卫着一个高地，看日军如潮水般涌上。拼刺刀，最后我们居然赢了，仅存的几个日军苟延残喘，躺在地上，被我们俘虏（不可思议），我们询问他们长官的下落，最后在他们身上居然翻出了手机，还用着微信，看了一下聊天记录，这个小兵居然在追日文版三体，然后我对他说 we are borthers。（原话是我们已经是同志了！） 2019-07-03真的变成慕容啸宇了。wired 2019-07-04全部门一起去上海，不知道去干嘛。坐在大巴倒数第二排，不知道为什么。 2019-07-09家里的房子似乎变成了小时候住的样子，不过围墙都拆了，墙面重新粉刷过。 2019-07-15做了两个梦，前一个梦已经忘得一干二净，只记得不知道为什么做梦做到一半我的蓝牙音响突然想了，开始播放《红旗颂》把我着实吓了一跳。下半场的梦就略显诡异了。和鲁哥还是丁哥我忘了，一起去临安玩。结果风景区里面居然存在违法乱纪的场所。我们想着要不也去探探究竟，看看这种败坏社会风气的场所到底是怎么一回事。结果去了以后，我看到了一个非常漂亮的小姐姐，乍一看长得特别像谭卓，是我喜欢的轻熟的类型，实在太有女人味。那场所也实在太不隐蔽，门敞开的，都能听到里面的叫声。周围众多游客走动，但似乎都无视这边的响动。我问了那个像谭卓的小姐姐，问她有没有空，然而她好像并没有空，所以我就等着。然后又看到谁窃窃私语的说警察来了，巴拉巴拉，然后我就醒了。（果然是日有所思，夜有所想，尽瞎想） 2019-07-16起来还记得，过了一小时记不起来了，呃呃。只记得回家了。 2019-07-17这几天游泳很累，老是做梦啊。梦到在蜘蛛侠的电影中。在Happy的一栋房子里，本来是要揭晓一项什么东西，蜘蛛侠的装备还是什么？但是有坏人袭击，损失惨重，最后等坏人离去，Happy才带蜘蛛侠进入一个房间。里面的一个玻璃透明柜里写着，伊迪丝 。第二个梦，我又梦到她了。这次居然是我和她一起上高中，住在一起晚自习后回宿舍，她说要煮面，煮了一份西红柿鸡蛋面，特别的清淡。住在一起的还有yyj和新来移动的一个女生。刚回宿舍，yyj说空调怎么不给力，巴拉巴拉，我说是因为刚开的原因。我什么时候才能忘了她呢，很难了。 2019-07-18梦到去游泳，游泳馆居然在地下好几层的地方。后来，又梦到她了，很奇怪，梦到的是和她qq聊天的内容，她让我把我gitlab的头像删掉，因为我用了她的头像。我删掉后说了句你是不是眼瞎，明明删掉了。哎，和现实中聊天内容一模一样。","link":"/2019/06/18/愚公解梦/"},{"title":"护网行动","text":"准备数据迁移","link":"/2019/06/14/护网行动/"},{"title":"一些写给自己的话","text":"古希腊哲学家赫拉克利特曾经说过，人不能两次踏入同一条河流，因为无论是这条河还是这个人都已经不同。 最终还是分手了。一年多的时间，分分合合。不愉快的时间比较多吧。 大家都觉得我们不合适。我还记得去年回家时候家母第一次问起她的情况，我兴高采烈的和母亲说着，憧憬着未来的生活，丝毫没有注意到母亲微变的脸色。母亲委婉的对我说从硬件条件、学历家庭来看会不会不太合适。其实，我之前从来没想过这种问题，那时候我坚定的认为只要两个人之间有爱，就够了！那时候的人，真的是天真啊。当然这件事，我完全没有和她说，也许后来提过。刚开始的时候，她和我说，如果家里不同意，那么还是早散的好。我那时候想啊，人怎么会有这种想法呢？明明是喜欢着对方，就因为家里的反对，就可以做到分手，那么这种感情也挺廉价的吧。当然后来，我也理解了。她年龄不小了，不可能做到像小姑娘们那样，为了喜欢和爱可以奋不顾身，并且，冲着结婚去的恋爱，必定是要考虑对方家庭态度的。在正确的时间做正确的事情。该恋爱的时候就谈恋爱。错过了正确的时间，年纪大了，说实话做什么事情都是顾这顾那的，爱情本身很多很纯粹的东西就丢掉了。因此，从一开始，我的心里负担就挺重的，家里的反对只能默默承受。现在想来，是不是当初被家里否定了以后就结束这段感情比较好，也不会像现在一样还会有负罪感。但是很多事情都不是非对即错的！如果当初就结束这段感情，也就不会有后来的各种经历。人总是要经历过一些事情才会成长的。 回到问题的本身，其实旁观者清这句话是很有道理的。不识庐山真面目，只缘身在此山中吧。她出社会比较早，社会经验比我丰富，很多想法都比我成熟。她的很多观点我最后也接受了，应用起来反而比她还要好。但说实话，因为学历和所处圈子的原因，她比较奉行实用主义的观点（换句话说小市民），而缺乏了一份理想主义的纯粹，而我是比较理想化的人，没有对错之分，人和人之间信奉的主义思潮理想观点本身就大相径庭的。当热恋期过后，两个人之间见识、观点的巨大差异逐渐的暴露出来，矛盾也多了起来。我开始意识到，这段感情已经开始偏离我所期待的轨迹。之前，我想的太简单了。而她，其实是缺乏深层次思考能力的，很多问题并不是说一句两个人到时候共同面对就能解决的，虽然我不否认很多矛盾随着时间会迎刃而解，不废摧毁之力，但是更多的问题是不可调和的或者说是需要理性思维缜密思考的。说一句到时候一起面对一起解决，谁不会说呢？其实我有个想法很天真的，试图去改变一个人。当然，这个想法证明是徒劳的，疯狂的，吃力不讨好的。一个人的生活习惯和思维见识是由一个人从出生开始20多年慢慢塑造出来的，父母都不可能轻易影响，怎么可能被其他人轻易改变呢？我开始预设一个观点，那就是她所做的所想的只要不和我意的都是错的。当我不认同她的大多数观点和生活方式时，其实爱情已经死了。对她而言，她的另一半全盘否定了她，如果这样还要勉强过下去，那会令她崩溃。对我而言，面对一个被自己否定的人，还要继续装作很爱她时，我也是痛苦的。 也许，压倒骆驼的最后一个稻草是关于结婚的讨论。她一直在说彩礼我能给多少三金给多少，她的朋友们拿到多少云云，这让我彻底对结婚这件事情失去了盼头，在我的观念中，婚姻两家都是尽最大可能给小两口创造一个好的起步基础，而不是只有一方付出。当自己没有付出时，就不断的考虑自己能获得多少，这是我不能接受的，结婚，她不会就出个人吧，那我图什么呢？未来花几百万买房买车，我的家庭父母已经付出够多了！并且，讨论这些话题的时机其实并没有到，这么早提出来我觉得特别的俗气和功利。最后，再加上本身对她的失望，分手已经是不可避免的了。其实这个话题，我也和家里谈过。母亲有一句话深得我心，说聪明的女生根本没有必要直接提这些问题。我也是这么认可了的。两个人确认了彼此，见了家长，只要双方家庭的出发点都是为小两口好，作为男方家肯定会主动表示的呀，女生根本没必要问。还没到谈婚论嫁那一步那么早问又有什么意义呢，拿出来彩礼多就说明更爱她么，这个逻辑是完全不通的。 我之前觉得两个人学历差距大没什么大不了的。但现在我发现还是说明一些问题的。见识其一，思考能力其二，是否有追求其三。人各有各的活法这没错，学历也不是全部，学历低过得好的人比比皆是。我自诩已经够没追求了，所以我实在接受不了比我还没追求和求知欲的人，在现代社会，一个人怎么可以这么不爱学习。她比我好的地方在于社会经验比我充裕，但如果真的在一起，几年后呢？刚开始谈的时候，她比我现实些，现在我比她现实多了。任何会影响未来几十年生活的因素我都会考虑，当然这样也给自己制造了枷锁。但我提的这些不是很基本的么，热爱学习，有点追求，会思考这些不是很简单么，做到有那么难么？ 其实，我做得不好和不对的地方也特别多。所以，我的负罪感也很强烈，心里的包袱也一直困扰着我。正如开头所说，人不能两次踏入同一条河流，经历了那么多，人总要从过去吸取教训，避免重蹈覆辙。（这好像也是她说的话，哎哎）第一，作为男人，是要有责任感和担当的。 不能享受一个人的好，但又负不起责任，天下没有这种好事。很显然，我做的不好。分分合合数次，其实每次复合，问题和矛盾都没有解决！！这样复合又有什么意义呢？反而会对她造成进一步伤害。第二，永远不要冷暴力。最后分手，她打我电话我再也没有接。当时想着，已经不知道说些什么了，没必要了。但其实现在看来，即使是分手，也是本着负责的态度要说清楚的，我一直后悔到现在。都是成年人，不喜欢了有矛盾不可调和直接说就是了，为什么要遮遮掩掩呢？对自己的不负责，也是对他人的不负责。其实在谈恋爱的时候，我对她有时也挺忽冷忽热的，因为心里就认定两个人会分手，谈不下去。因此，她觉得和我在一起没有恋爱的感觉也是理所应当的。从这个角度看，其实，她值得一个更好的人去关心她去爱她。也许早该断了的！我太不真诚了。本来答应她见父母的，但还没等父母过来，就已经分手了。第三，其实我也挺幼稚的。她其实有些时候挺照顾我的感受的，但我往往后知后觉了，把她对我的好作为理所当然了。 其实，她是一个很好的姑娘，有些时候挺通情达理的，虽然情绪控制能力不是很强，会莫名其妙生气，也没什么追求和见识，但其实很多男生就喜欢这样的女生。只是这里面已经没有我了。我已经看不到她的优点了。上一次分手，她说的一句话特别刺痛我的心：我用真心对你，但换来的却是这样的结果。这种无力感一直困扰着我，因为她对我好的方面，并不是我所诉求想要的方面，所以我也一直不敢毫无保留的对她好吧，见朋友见兄弟姐妹见家长，我都没有做到。也许真的就是不合适吧。 其实，我有时也会莫名其妙的自卑。但我从来不敢和她说。别人会想，你堂堂浙大毕业，家里条件还不错，家里车房都备着，怎么在这么一段恋爱关系上还会自卑。但我真的是自卑的。我仔细想过这个问题。自卑的根源来自自己对现状的不满，除了一个好学校毕业的虚名，本身的条件并不优秀，不如意的工作与收入，与同龄人的差距等。记得一次你和我说，想带我和你的朋友们一起去泰国玩，我其实是想去的，但我那时候真的穷，又怕和你闺蜜们的男友们比较，所以死活说不喜欢去。现在想想，也是挺可笑的，不想见你朋友也大概是这个原因吧。也许想让你上进的根源也在于自己已经挥霍了大学的四年，急于改变现状，再昏昏碌碌的度过余生对我来说是非常不能接受的事情吧。如果我足够强大，可能很多现阶段我在意的事情我都不会再去在意，当然可能人的想法也会变的。或许在这个时间点，我确实也不适合恋爱吧。因为我本阶段首要做的事情是自我价值的实现，回到自己的小圈子里，而你现在首要的任务是把自己终身大事搞定。 这次分手，应该不会再复合了，信任和喜欢已经被消耗殆尽了。但说来奇怪，每次分手后，我首先能回忆起来的都是她对我的好，然后寻求复合以后，又发现是一堆没有解决的问题。所以，这次，在我不能够解决问题的情况下，我不会再去找你了！！也许，这次我们在人生的轨迹上已经越行越远了。我也不知道什么时候才能从这种情绪下走出来，也不知道我到底诉求的是什么，不知道什么样的女生才是合适我的。当我寻找出答案的时候，可能她已经走远了，但人生不就如此么？有的人错过了，有的人最终还能重逢，都是命运的注定，最重要的是自己要幸福，不留遗憾。","link":"/2019/07/15/20190715随想/"},{"title":"第一次华山论剑","text":"还是清明去的华山，一直拖到现在，才想着写一篇游记。","link":"/2019/06/21/第一次华山论剑/"}],"tags":[{"name":"随想","slug":"随想","link":"/tags/随想/"},{"name":"阅读","slug":"阅读","link":"/tags/阅读/"},{"name":"plans","slug":"plans","link":"/tags/plans/"},{"name":"个人爱好","slug":"个人爱好","link":"/tags/个人爱好/"},{"name":"工作心得","slug":"工作心得","link":"/tags/工作心得/"},{"name":"游记","slug":"游记","link":"/tags/游记/"}],"categories":[]}